<!-- PROFILE LINK -->
<h1 style = "text-align:center; font-size: 30px">PROGRAMACIÓN CONCURRENTE Y DISTRIBUIDA</h1>
<a href ="https://github.com/sukuzhanay">
<img src="https://avatars.githubusercontent.com/u/17354471?v=4" style="float:left;vertical-align:centre" width="110" height="110" title = "Christian Vlaldimir Sucuzhanay Arevalo 21535220">
<a href ="https://github.com/sukuzhanay?tab=repositories">
<img src="https://media-exp1.licdn.com/dms/image/C4D0BAQEu_Aa76fcmPw/company-logo_200_200/0/1630998679429?e=2159024400&v=beta&t=2feC9GG7RWCWizTqsK5HzDWB1TL2DOQuAVwnMf6FFvk" title = "M41" alt="UE" width="110" height="110" style="float:right;vertical-align:centre">

# Pandas 1
## *Session 4*

Pandas es una librerıa de Python construida sobre Numpy, que contiene estructuras de datos
de alto nivel y herramientas de manipulacion, diseñada para hacer
el análisis de datos de una manera facil y rapida. Algunos de los
objetivos que Pandas soluciona en cuanto a la manipulacion de
datos son:

    
-  Estructuras de datos con ejes etiquetados automaticamente o
especificando la alineacion de los datos para prevenir errores.
- Total funcionalidad para series de tiempo.
- Las mismas estructuras de datos son capaces de manejar tanto series temporales como series no temporales.
- Operaciones aritmeticas y reducciones se pueden pasar
directamente sobre los ejes, aprovechando el ındice de los
mismos.
- Ofrece una manera flexible de manipular datos incompletos.
- Ofrece operaciones de union y otras relaciones tıpicas de bases
de datos relacionales.

Durante esta sesión vamos a trabajar con dos tipos de estructuras:  **Series** una estructura similar a un vector con un índice asociado, y **DataFrame**, una estructura para almacenar datos en forma de tabla que también incorpora un índice. **Incorpora múltiples métodos para el análisis de datos, prepración de datos, estadística, etc .**

In [ ]:
# pip install numpy --upgrade --ignore-installed

In [2]:
import pandas as pd
import numpy as np

In [3]:
import warnings
warnings.filterwarnings("ignore")

## 1. Series

La clase Series representa objetos tipo array con un índice asociado. Podemos instanciar una serie a partir de listas, arrays, diccionarios, etc .

In [2]:
lista1 = [1.2, 2, 3, 45, 5]

In [5]:
lista1

[1.2, 2, 3, 45, 5]

In [4]:
from pandas import Series

serie = Series([1000000, 22, 13, 64, 95])
print(serie)

0    1000000
1         22
2         13
3         64
4         95
dtype: int64

La representacion de un objeto Series muestra el ındice en la parte
izquierda y los valores en la derecha. Pandas posee dos atributos
para acceder tanto al ındice como a los valores:

In [6]:
#Para acceder a los valores de la lista y a sus claves
print(serie.values)
print(serie.index)

[1000000      22      13      64      95]
RangeIndex(start=0, stop=5, step=1)

In [7]:
type(serie.values)

numpy.ndarray

In [8]:
#Crear una series especificando el índice
serie = Series([1, 2, 3, 4, 5.9], index = ['uno', 'dos', 'tres', 'cuatro', 'cinco'])
print(serie)

uno       1.0
dos       2.0
tres      3.0
cuatro    4.0
cinco     5.9
dtype: float64

In [9]:
#Para acceder a los valores de la lista y a sus claves
print(serie.values)

[1.  2.  3.  4.  5.9]

In [10]:
print(serie.index)

Index(['uno', 'dos', 'tres', 'cuatro', 'cinco'], dtype='object')

Podemos aplicar todas las funciones que hemos visto con NumPy:

In [11]:
#Acceder a elementos de una serie
print(serie[['cuatro', 'uno', 'tres']])

cuatro    4.0
uno       1.0
tres      3.0
dtype: float64

In [12]:
#Acceder al valor
print(serie['tres'])

3.0

In [13]:
type(serie)

pandas.core.series.Series

In [14]:
type(serie['tres'])

numpy.float64

In [15]:
#Filas
print(serie[1:3])

dos     2.0
tres    3.0
dtype: float64

In [16]:
serie

uno       1.0
dos       2.0
tres      3.0
cuatro    4.0
cinco     5.9
dtype: float64

In [17]:
serie > 3

uno       False
dos       False
tres      False
cuatro     True
cinco      True
dtype: bool

In [18]:
serie['cinco'] = 88

In [19]:
serie

uno        1.0
dos        2.0
tres       3.0
cuatro     4.0
cinco     88.0
dtype: float64

In [20]:
#Por condiciones
serie[serie > 3] = 99

In [21]:
serie

uno        1.0
dos        2.0
tres       3.0
cuatro    99.0
cinco     99.0
dtype: float64

In [22]:
np.exp(serie)

uno       2.718282e+00
dos       7.389056e+00
tres      2.008554e+01
cuatro    9.889030e+42
cinco     9.889030e+42
dtype: float64

### Funciones anónimas

En Python, las funciones lambda son también conocidas como funciones anónimas porque se definen sin un nombre.

Como sabes, una función en Python se define con la palabra reservada **def**. Sin embargo, una función anónima se define con la palabra reservada **lambda**.

-  La sintaxis para definir una función lambda es la siguiente:

      **lambda parámetros: expresión**

A continuación, se detallan las características principales de una función anónima:

- Son funciones que pueden definir cualquier número de parámetros pero una única expresión. Esta expresión es evaluada y devuelta.

- Se pueden usar en cualquier lugar en el que una función sea requerida.

- Estas funciones están restringidas al uso de una sola expresión.

- Se suelen usar en combinación con otras funciones, generalmente como argumentos de otra función.

In [23]:
cuadrado = lambda x: x ** 2

print(cuadrado(3))

9

In [24]:
## definición sin lambda

def cuadrado(x):
     return x ** 2
    
print(cuadrado(3))

9

### Ejemplos de uso comunes de funciones lambda: map(), filter() y reduce()

En esta sección vamos a descubrir el potencial de las funciones lambda, especialmente cuando se usan en combinación con otras funciones.

- ### Map()

https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html

La función **map()** se utiliza para mapear valores de Series según la correspondencia de entrada.

Se utiliza para sustituir cada valor de una Serie por otro valor, que puede derivarse de una función, un dict o una Serie.

**Series.map(self, arg, na_action=None)**

In [25]:
s = Series(['fox', 'cow', np.nan, 'dog'])
s

0    fox
1    cow
2    NaN
3    dog
dtype: object

map acepta un dict o una serie. Los valores que no se encuentran en el dict se convierten en NaN, a menos que
el dict tenga un valor por defecto (por ejemplo, defaultdict):

In [26]:
ddd = {'fox': 'cub', 'cow': 'calf'};ddd

{'fox': 'cub', 'cow': 'calf'}

In [29]:
ddd.get('fox', [1, 23])

'cub'

In [35]:
s.map(lambda x: ddd.get(x, -1))

0     cub
1    calf
2      -1
3      -1
dtype: object

También acepta una función

In [40]:
x = 10

In [41]:
'hoy es dia ' + str(x)

'hoy es dia 10'

In [42]:
'hoy es dia %f' %(10)

'hoy es dia 10.000000'

In [43]:
'hoy es dia {} del mes {}'.format(15, 11.5)

'hoy es dia 15 del mes 11.5'

In [ ]:
s.map('I am a {}'.format)

Para evitar aplicar la función a los valores perdidos (y mantenerlos como NaN) se puede utilizar na_action='ignore':

In [47]:
s.map('I am a {}'.format, na_action='ignore')

0    I am a fox
1    I am a cow
2           NaN
3    I am a dog
dtype: object

- Más ejemplos

**map(una_funcion, una_lista)**

In [ ]:
enteros = [1, 2, 4, 7]

cuadrados = []

for e in enteros:
    cuadrados.append(e ** 2)
    print(cuadrados)
print(cuadrados)

In [ ]:
print(cuadrados)

Sin embargo, podemos usar una función anónima en combinación con map() para obtener el mismo resultado de una manera mucho más simple:

In [ ]:
enteros = [1, 2, 4, 7]

cuadrados = list(map(lambda x : x ** 2, enteros))

print(cuadrados)

La cosa se vuelve todavía más interesante cuando, en lugar de una lista de valores, pasamos como segundo parámetro una **lista de funciones**:

In [49]:
enteros = [1, 2, 4, 7]

def cuadrado(x):
    return x ** 2

def cubo(x):
    return x ** 3

funciones = [cuadrado, cubo]

In [50]:
enteros

[1, 2, 4, 7]

In [51]:
for e in enteros:
    print(e)
    valores = list(map(lambda x : x(e), funciones))
    print(valores)

1
[1, 1]
2
[4, 8]
4
[16, 64]
7
[49, 343]

## 2. DataFrame

Pandas es una herramienta de análisis de datos altamente eficiente y ampliamente utilizada. La estructura de datos central de Pandas es DataFrame. Existen muchas funciones y métodos potentes y flexibles de DataFrame que facilitan y aceleran el proceso de análisis y limpieza de datos.

Un Dataframe es una tabla indexada por filas y columnas, todas las columnas tienen que almacenar un mismo tipo de valor (son Series), es decir un Dataframe es una tabla compuesta de Series con el mismo índice.

### 2.1 Crear un DataFrame

In [52]:
#Crear un Dataframe a partir de un diccionario
from pandas import DataFrame

diccionario = {'Nombre': ['Pablo', 'Manuel', 'Edgar', 'Eric', 'Maria'], 
               'Edad': [23, 11, 35, 68, 16],
               'Telefono': [652289, 6551243, 662564, 4334448, 433321]}
print(diccionario)

{'Nombre': ['Pablo', 'Manuel', 'Edgar', 'Eric', 'Maria'], 'Edad': [23, 11, 35, 68, 16], 'Telefono': [652289, 6551243, 662564, 4334448, 433321]}

In [53]:
data = pd.DataFrame(diccionario)
data

   Nombre  Edad  Telefono
0   Pablo    23    652289
1  Manuel    11   6551243
2   Edgar    35    662564
3    Eric    68   4334448
4   Maria    16    433321

En Pandas se puede especificar el orden de las columnas y el índice en la creación:

In [60]:
data = DataFrame(diccionario, columns = ['Edad','Nombre',  'Telefono'], 
                 index = ['j33', 'v41', 'b45', 'p28', 'r36'])
data

     Edad  Nombre  Telefono
j33    23   Pablo    652289
v41    11  Manuel   6551243
b45    35   Edgar    662564
p28    68    Eric   4334448
r36    16   Maria    433321

In [62]:
data['kk'] = 1

In [63]:
data

     Edad  Nombre  Telefono            e-mail  kk
j33    23   Pablo    652289  pepito@gmail.com   1
v41    11  Manuel   6551243   perez@gmail.com   1
b45    35   Edgar    662564  trigal@gmail.com   1
p28    68    Eric   4334448  triste@gmail.com   1
r36    16   Maria    433321   tigre@gmail.com   1

In [61]:
#creamos una columna nueva "E-mail"
data['e-mail'] = ['pepito@gmail.com', 'perez@gmail.com', 'trigal@gmail.com', 'triste@gmail.com', 'tigre@gmail.com']
data

     Edad  Nombre  Telefono            e-mail
j33    23   Pablo    652289  pepito@gmail.com
v41    11  Manuel   6551243   perez@gmail.com
b45    35   Edgar    662564  trigal@gmail.com
p28    68    Eric   4334448  triste@gmail.com
r36    16   Maria    433321   tigre@gmail.com

También se puede crear un DataFrame a partir de listas:

In [64]:
df = pd.DataFrame([
    ["Pablo", 23, 652289],
    ["Manuel", 11, 6551243],
    ["Edgar", 35, 662564],
    ["Eric", 68, 4334448],
    ["Maria", 16, 433321]
], columns=["Nombre", "Edad", "Telefono"])
df

   Nombre  Edad  Telefono
0   Pablo    23    652289
1  Manuel    11   6551243
2   Edgar    35    662564
3    Eric    68   4334448
4   Maria    16    433321

### 2.2 Exportar y leer de ficheros CSV

Una de las formas mas habituales de generar un DataFrame es leerlo de un fichero. Pandas incorpora métodos para leer csv, json y bases de datos para introducir los datos en un DataFrame.

A través del siguiente enlace se pueden ver todas las opciones para leer dataframes: https://pandas.pydata.org/pandas-docs/dev/reference/api/pandas.read_csv.html

In [4]:
pd.read_csv?

In [103]:
df = pd.read_csv("data1.txt", sep=';', decimal=',');df

   Nombre  Edad  Telefono
0   Pablo  23.0    652289
1  Manuel  11.0   6551243
2   Edgar  35.0    662564
3    Eric  68.0   4334448
4   Maria  16.0    433321
5    Pepe  25.2    958493

In [98]:
csv_df.sum(axis=0)

Nombre      PabloManuelEdgarEricMariaPepe
Edad                                178.2
Telefono                         13592358
dtype: object

In [79]:
csv_df.to_csv('data_con_indice.csv', index=True, encoding='utf8') # por defecto index=true y se guarda el indice del dataframe

### 2.3 Inspeccionar DataFrames
Si el DataFrame es pequeño, siempre podemos inspeccionar el DataFrame con `print(df)`. Pero normalmente esta opción no será viable, por lo que Pandas proporciona algunas funciones para poder inspeccionar el DataFrame:
- `head()` muestra las 5 primeras líneas.
- `tail()` muestra las 5 últimas líneas.
- `info()` muestra información general de las columnas.
- `describe()` calcula estadísticas básicas de las columnas.

In [105]:
df.head(2)

   Nombre  Edad  Telefono
0   Pablo  23.0    652289
1  Manuel  11.0   6551243

In [106]:
print(df.head(2))
print("-"*100)
print(df.tail(2))
print("-"*100)
print(df.info())
print("-"*100)
print(df.describe())

   Nombre  Edad  Telefono
0   Pablo  23.0    652289
1  Manuel  11.0   6551243
----------------------------------------------------------------------------------------------------
  Nombre  Edad  Telefono
4  Maria  16.0    433321
5   Pepe  25.2    958493
----------------------------------------------------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    6 non-null      object
 1   Edad      6 non-null      float64
 2   Telefono  6 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes
None
----------------------------------------------------------------------------------------------------
            Edad      Telefono
count   6.000000  6.000000e+00
mean   29.700000  2.265393e+06
std    20.481699  2.564572e+06
min    11.000000  4.333210e+05
25%    17.750000  6.548578e+05
50%    24.100000  8.105285e+05
75%    32.550000  3.490459e+06
max    68.000000  6.551243e+06

### 2.4 Uso del parámetro axis en los métodos de Pandas

El parámetro `axis` especifica la dirección a lo largo de la cual se aplica un determinado método o función en un DataFrame. **axis = 0 representa que la función se aplica en forma de columna, y  axis = 1 significa que la función se aplica en forma de fila en el DataFrame.**

#### Usar axis=0 en los métodos de Pandas

In [107]:
import pandas as pd

empl_df = pd.DataFrame({
    'Name': ["Jon", "Willy", "Mike", "Luna", "Sam", "Aliza"],
    'Age': [30, 33, 35, 30, 30, 31],
    'Weight(KG)': [75, 75, 80, 70, 73, 70],
    'Height(meters)': [1.7, 1.7, 1.85, 1.75, 1.8, 1.75],
    'Salary($)': [3300, 3500, 4000, 3050, 3500, 3700]

})
empl_df

    Name  Age  Weight(KG)  Height(meters)  Salary($)
0    Jon   30          75            1.70       3300
1  Willy   33          75            1.70       3500
2   Mike   35          80            1.85       4000
3   Luna   30          70            1.75       3050
4    Sam   30          73            1.80       3500
5  Aliza   31          70            1.75       3700

In [108]:
empl_df['Height(meters)']

0    1.70
1    1.70
2    1.85
3    1.75
4    1.80
5    1.75
Name: Height(meters), dtype: float64

Calcula la media por columnas del DataFrame empl_df. La media se calcula sólo para las columnas con valores numéricos.

Si ponemos axis=0, calculará la media de cada columna promediando los valores de las filas de esa columna en particular.

In [ ]:
empl_df.mean(axis=0)

In [ ]:
print(empl_df.mean()) # axis=0 es por defecto

#### Ejemplo: Usar axis=1 en los métodos de Pandas

Calcula la media por filas del DataFrame empl_df, es decir, calculará el valor medio de cada fila promediando los valores de las columnas de tipo numérico de esa fila. Obtendremos una única columna al final con el valor medio de cada fila.

In [ ]:
(3300+1.70 +75+30 )/4

In [ ]:
print(empl_df.sum(axis=1))

### 2.5  Indexando y Fragmentando en Python

A menudo necesitamos trabajar con subconjuntos de un objeto DataFrame. Existen diferentes maneras de lograr esto, incluyendo: usando etiquetas (encabezados de columnas), rangos numéricos, o índices de localizaciones específicas x,y.

#### Seleccionando datos mediante el uso de Etiquetas (Encabezados de Columnas)

Utilizamos corchetes [] para seleccionar un subconjunto de un objeto en Python. Por ejemplo, podemos seleccionar todos los datos de una columna llamada species_id del surveys_df DataFrame usando el nombre de la columna. Existen dos maneras de hacer esto:

In [109]:
# Asegura que panda este disponible
import pandas as pd

# lee el archivo **surveys** CSV
surveys_df = pd.read_csv("surveys.csv")

In [110]:
surveys_df

       record_id  month  day  year  plot species  sex   wgt
0              1      7   16  1977     2      NL    M   NaN
1              2      7   16  1977     3      NL    M   NaN
2              3      7   16  1977     2      DM    F   NaN
3              4      7   16  1977     7      DM    M   NaN
4              5      7   16  1977     3      DM    M   NaN
...          ...    ...  ...   ...   ...     ...  ...   ...
35544      35545     12   31  2002    15      AH  NaN   NaN
35545      35546     12   31  2002    15      AH  NaN   NaN
35546      35547     12   31  2002    10      RM    F  14.0
35547      35548     12   31  2002     7      DO    M  51.0
35548      35549     12   31  2002     5     NaN  NaN   NaN

[35549 rows x 8 columns]

In [114]:
# Método 1: selecciona un 'subconjunto' de los datos usando el nombre de la columna
surveys_df[['species', 'year']]

      species  year
0          NL  1977
1          NL  1977
2          DM  1977
3          DM  1977
4          DM  1977
...       ...   ...
35544      AH  2002
35545      AH  2002
35546      RM  2002
35547      DO  2002
35548     NaN  2002

[35549 rows x 2 columns]

In [ ]:
# Método 2: usa el nombre de la columna como un 'atributo'; esto produce la misma salida
surveys_df.species

También podemos crear un nuevo objeto que contiene solamente los datos de la columna `species` de la siguiente manera:

In [115]:
# Crea un objeto, `surveys_species`, que solamente contenga la columna `species`
surveys_species = surveys_df['species']
surveys_species

0         NL
1         NL
2         DM
3         DM
4         DM
        ...
35544     AH
35545     AH
35546     RM
35547     DO
35548    NaN
Name: species, Length: 35549, dtype: object

In [116]:
surveys_species = 'PP'

In [117]:
surveys_species

'PP'

También podemos pasar una lista de nombres de columnas, a manera de índice para seleccionar las columnas en ese orden. Esto es útil cuando necesitamos reorganizar nuestros datos.

**NOTA**: Si el nombre de una columna no esta incluido en el `DataFrame`, se producirá una excepción (error).

In [ ]:
# ¿Qué pasa si preguntamos por una columna que no existe?
# surveys_df['speciess']

Python nos informa que tipo de error es en el rastreo, en la parte inferior dice KeyError: 'speciess' lo que significa que speciess no es un nombre de columna (o Key que está relacionado con el diccionario de tipo de datos de Python).

In [118]:
# Selecciona species y plot
surveys_df[['species', 'plot']]

      species  plot
0          NL     2
1          NL     3
2          DM     2
3          DM     7
4          DM     3
...       ...   ...
35544      AH    15
35545      AH    15
35546      RM    10
35547      DO     7
35548     NaN     5

[35549 rows x 2 columns]

In [119]:
# ¿Qué pasa cuando invertimos el orden?
surveys_df[['plot', 'species', 'sex', 'wgt']]

       plot species  sex   wgt
0         2      NL    M   NaN
1         3      NL    M   NaN
2         2      DM    F   NaN
3         7      DM    M   NaN
4         3      DM    M   NaN
...     ...     ...  ...   ...
35544    15      AH  NaN   NaN
35545    15      AH  NaN   NaN
35546    10      RM    F  14.0
35547     7      DO    M  51.0
35548     5     NaN  NaN   NaN

[35549 rows x 4 columns]

### Extrayendo subconjuntos basados en rangos: Segmentando

**RECORDATORIO**: Python usa Indexación en base-0

Recordemos que Python usa indexación en base-0. Esto quiere decir que el primer elemento en un objeto esta localizado en la posición 0. Esto es diferente de otros lenguajes como R y Matlab que indexan elementos dentro de objetos iniciando en 1.

In [ ]:
# Crea una lista de números:
a = [1, 2, 3, 4, 5]

In [ ]:
a[0]

In [ ]:
# a[len(a)]

In [ ]:
a[len(a)-1]

#### Segmentando Subconjuntos de Filas en Python

La segmentación utilizando el operador [] selecciona un conjunto de filas y/o columnas de un DataFrame. Para segmentar un conjunto de filas, usa la siguiente sintaxis: `data[start:stop]`. Cuando se hace segmentación en pandas, el límite inicial (start) se incluye en los datos de salida. El límite final (stop) es un paso MÁS ALLÁ de la fila que desea seleccionar.

In [120]:
# Selecciona las filas 0, 1, 2 (la fila 3 no es seleccionada)
surveys_df[0:3]

   record_id  month  day  year  plot species sex  wgt
0          1      7   16  1977     2      NL   M  NaN
1          2      7   16  1977     3      NL   M  NaN
2          3      7   16  1977     2      DM   F  NaN

El límite final en Python es diferente del que puedes estar acostumbrado a usar en Lenguajes como Matlab y R.

In [ ]:
# Selecciona las primeras cinco filas (con índices 0, 1, 2, 3, 4)
surveys_df[:5]

In [121]:
# Selecciona el último elemento de la lista
# (el segmento comienza en el último elemento y finaliza al final de la lista)
surveys_df[-1:]

       record_id  month  day  year  plot species  sex  wgt
35548      35549     12   31  2002     5     NaN  NaN  NaN

In [123]:
surveys_df.tail(1)

       record_id  month  day  year  plot species  sex  wgt
35548      35549     12   31  2002     5     NaN  NaN  NaN

In [124]:
empl_df.dtypes

Name               object
Age                 int64
Weight(KG)          int64
Height(meters)    float64
Salary($)           int64
dtype: object

In [126]:
empl_df

    Name  Age  Weight(KG)  Height(meters)  Salary($)
0    Jon   30          75            1.70       3300
1  Willy   33          75            1.70       3500
2   Mike   35          80            1.85       4000
3   Luna   30          70            1.75       3050
4    Sam   30          73            1.80       3500
5  Aliza   31          70            1.75       3700

In [127]:
empl_df['Weight(KG)'] < 75

0    False
1    False
2    False
3     True
4     True
5     True
Name: Weight(KG), dtype: bool

In [131]:
filtro = (empl_df['Weight(KG)'] < 75) & (empl_df['Height(meters)'] >= 1.75)

In [132]:
filtro

0    False
1    False
2    False
3     True
4     True
5     True
dtype: bool

In [133]:
empl_df[filtro]

    Name  Age  Weight(KG)  Height(meters)  Salary($)
3   Luna   30          70            1.75       3050
4    Sam   30          73            1.80       3500
5  Aliza   31          70            1.75       3700

In [134]:
surveys_df[surveys_df['species']=='AH']

       record_id  month  day  year  plot species  sex  wgt
1445        1446     11    5  1978    15      AH  NaN  NaN
7019        7020     11   21  1982    24      AH  NaN  NaN
7644        7645      4   16  1983    24      AH  NaN  NaN
8640        8641     11   13  1983    15      AH  NaN  NaN
9494        9495      8   26  1984     9      AH  NaN  NaN
...          ...    ...  ...   ...   ...     ...  ...  ...
35370      35371     12    8  2002    14      AH  NaN  NaN
35457      35458     12   29  2002    20      AH  NaN  NaN
35477      35478     12   29  2002    24      AH  NaN  NaN
35544      35545     12   31  2002    15      AH  NaN  NaN
35545      35546     12   31  2002    15      AH  NaN  NaN

[437 rows x 8 columns]

In [135]:
surveys_df[surveys_df['species']=='AH'].record_id.min()

1446

In [ ]:
surveys_df[-4:-2]

También podemos reasignar valores dentro de subconjuntos de nuestro DataFrame.

Pero antes de hacerlo, veamos la diferencia entre el concepto de copiar objetos y el concepto de referenciar objetos en Python.

### 2.6 Copiar Objetos vs Referenciar Objetos en Python

Empecemos con un ejemplo:

In [160]:
x = [1, 2]
y = x

In [161]:
print(x, y)

[1, 2] [1, 2]

In [162]:
x[0] = 99

In [164]:
print(x,y)

[99, 2] [99, 2]

In [158]:
y[1] = 88

In [159]:
print(x,y)

[99, 2] [1, 88]

In [136]:
# Usando el método 'copy()'
true_copy_surveys_df = surveys_df.copy()

In [137]:
# Usando el operador '='
ref_surveys_df = surveys_df

Puedes pensar que el código **ref_surveys_df = surveys_df** crea una copia nueva y distinta de objeto DataFrame surveys_df. Sin embargo, usar el operador = en una instrucción simple de la forma y = x no crea una copia de nuestro DataFrame. En lugar de esto, y = x crea una variable nueva y que hace referencia al mismo objeto al que x hace referencia. Para decirlo de otra manera, **solamente hay un objeto (el DataFrame), y ambos objetos x y y hacen referencia a él.**

En contraste, **el método copy() de un DataFrame crea una copia verdadera del DataFrame.**

Veamos lo que sucede cuando reasignamos los valores dentro de un subconjunto del DataFrame que hace referencia a otro objeto DataFrame:

In [138]:
ref_surveys_df

       record_id  month  day  year  plot species  sex   wgt
0              1      7   16  1977     2      NL    M   NaN
1              2      7   16  1977     3      NL    M   NaN
2              3      7   16  1977     2      DM    F   NaN
3              4      7   16  1977     7      DM    M   NaN
4              5      7   16  1977     3      DM    M   NaN
...          ...    ...  ...   ...   ...     ...  ...   ...
35544      35545     12   31  2002    15      AH  NaN   NaN
35545      35546     12   31  2002    15      AH  NaN   NaN
35546      35547     12   31  2002    10      RM    F  14.0
35547      35548     12   31  2002     7      DO    M  51.0
35548      35549     12   31  2002     5     NaN  NaN   NaN

[35549 rows x 8 columns]

In [139]:
# Asigna el valor `0` a las primeras tres filas de datos en el **DataFrame**
ref_surveys_df[0:3] = 0

In [140]:
# ref_surveys_df fue creado usando el operador '='
ref_surveys_df.head()

   record_id  month  day  year  plot species sex  wgt
0          0      0    0     0     0       0   0  0.0
1          0      0    0     0     0       0   0  0.0
2          0      0    0     0     0       0   0  0.0
3          4      7   16  1977     7      DM   M  NaN
4          5      7   16  1977     3      DM   M  NaN

In [141]:
# surveys_df es el **DataFrame** original
surveys_df.head()

   record_id  month  day  year  plot species sex  wgt
0          0      0    0     0     0       0   0  0.0
1          0      0    0     0     0       0   0  0.0
2          0      0    0     0     0       0   0  0.0
3          4      7   16  1977     7      DM   M  NaN
4          5      7   16  1977     3      DM   M  NaN

¿Cuál es la diferencia entre estos dos DataFrames?

Cuando asignamos a las tres primeras filas el valor de 0 usando el DataFrame ref_surveys_df, el DataFrame surveys_df también es modificado. Recuerda que creamos el objeto ref_survey_df arriba usando la instrucción ref_survey_df = surveys_df. Por lo tanto surveys_df y ref_surveys_df hacen referencia exactamente al mismo objeto DataFrame. **Si cualquiera de los dos objetos (ref_survey_df, surveys_df) es modificado, el otro objeto va a observar los mismos cambios.**

**Hacemos lo mismo con el dataframe copiado**

In [165]:
# lee el archivo **surveys** CSV
surveys_df = pd.read_csv("surveys.csv")
# Usando el método 'copy()'
true_copy_surveys_df = surveys_df.copy()

In [166]:
# Asigna el valor `0` a las primeras tres filas de datos en el **DataFrame**
true_copy_surveys_df[0:3] = 0

In [167]:
true_copy_surveys_df.head()

   record_id  month  day  year  plot species sex  wgt
0          0      0    0     0     0       0   0  0.0
1          0      0    0     0     0       0   0  0.0
2          0      0    0     0     0       0   0  0.0
3          4      7   16  1977     7      DM   M  NaN
4          5      7   16  1977     3      DM   M  NaN

In [168]:
surveys_df.head()

   record_id  month  day  year  plot species sex  wgt
0          1      7   16  1977     2      NL   M  NaN
1          2      7   16  1977     3      NL   M  NaN
2          3      7   16  1977     2      DM   F  NaN
3          4      7   16  1977     7      DM   M  NaN
4          5      7   16  1977     3      DM   M  NaN

**Revisar y Recapitular:**

- Para crear una copia de un objeto, usamos el método copy() de un DataFrame

In [ ]:
true_copy_surveys_df = surveys_df.copy()

- Para crear una referencia a un objeto usamos el operador =

In [ ]:
ref_surveys_df = surveys_df

#### Segmentando subconjuntos de filas y columnas en Python

Podemos seleccionar subconjuntos de datos, contenidos en rangos específicos de filas y columnas, usando etiquetas o indexación basada en números enteros.

- `loc` permite obtener filas mediante el índice del dataframe. **Es usado principalmente para indexación basada en etiquetas**. Permite usar números enteros pero son interpretados como una etiqueta.


https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html

- `iloc` permite obtener filas mediante la posición en el índice, como un vector. **Es usado para indexación basada en números enteros**

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html

Para seleccionar un subconjunto de filas y columnas de nuestro objeto DataFrame, podemos usar el método iloc. Por ejemplo, podemos seleccionar month, day y year (que corresponden a las columnas 2, 3 y 4, si empezamos a contar las columnas en 1 para las primeras tres filas, de la siguiente manera:

**iloc[segmentación de fila, segmentación de columna]**

In [169]:
surveys_df = pd.read_csv("surveys.csv") # subimos el dataset

In [171]:
surveys_df.head()

   record_id  month  day  year  plot species sex  wgt
0          1      7   16  1977     2      NL   M  NaN
1          2      7   16  1977     3      NL   M  NaN
2          3      7   16  1977     2      DM   F  NaN
3          4      7   16  1977     7      DM   M  NaN
4          5      7   16  1977     3      DM   M  NaN

In [170]:
surveys_df.iloc[0:3, 1:5]

   month  day  year  plot
0      7   16  1977     2
1      7   16  1977     3
2      7   16  1977     2

Ten en cuenta que pedimos un segmento de 0:3. Esto produjo 3 filas de datos. Cuando pides un segmento de 0:3, le estas diciendo a Python que comience en el índice 0 y seleccione las filas 0, 1, 2, hasta 3 pero sin incluir esta última.

Exploremos otras maneras de indexar y seleccionar subconjuntos de datos:

In [175]:
surveys_df.head()

   record_id  month  day  year  plot species sex  wgt
0          1      7   16  1977     2      NL   M  NaN
1          2      7   16  1977     3      NL   M  NaN
2          3      7   16  1977     2      DM   F  NaN
3          4      7   16  1977     7      DM   M  NaN
4          5      7   16  1977     3      DM   M  NaN

In [180]:
lista = list(range(0,11))

In [188]:
lista

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [187]:
lista[::-1]

[10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0]

In [177]:
# Selecciona todas las columnas para las filas con índices  0 y 10
surveys_df.loc[[0, 10], ::3]

    record_id  year sex
0           1  1977   M
10         11  1977   F

In [191]:
surveys_df.iloc[0:10,:]

   record_id  month  day  year  plot species sex  wgt
0          1      7   16  1977     2      NL   M  NaN
1          2      7   16  1977     3      NL   M  NaN
2          3      7   16  1977     2      DM   F  NaN
3          4      7   16  1977     7      DM   M  NaN
4          5      7   16  1977     3      DM   M  NaN
5          6      7   16  1977     1      PF   M  NaN
6          7      7   16  1977     2      PE   F  NaN
7          8      7   16  1977     1      DM   M  NaN
8          9      7   16  1977     1      DM   F  NaN
9         10      7   16  1977     6      PF   F  NaN

In [192]:
# ¿Qué salida produce el la siguiente instrucción?
surveys_df.loc[0:10, ['species', 'plot', 'wgt']]

   species  plot  wgt
0       NL     2  NaN
1       NL     3  NaN
2       DM     2  NaN
3       DM     7  NaN
4       DM     3  NaN
5       PF     1  NaN
6       PE     2  NaN
7       DM     1  NaN
8       DM     1  NaN
9       PF     6  NaN
10      DS     5  NaN

In [193]:
# ¿Qué pasa cuando ejecutas el siguiente código?
surveys_df.loc[[0, 10, 333, 45, 21, 553], :]

     record_id  month  day  year  plot species  sex   wgt
0            1      7   16  1977     2      NL    M   NaN
10          11      7   16  1977     5      DS    F   NaN
333        334     10   18  1977     5      DM    F  45.0
45          46      7   18  1977    19      DM    M   NaN
21          22      7   17  1977    15      NL    F   NaN
553        554      1    9  1978    14      NL  NaN   NaN

In [195]:
# ¿Qué pasa cuando ejecutas el siguiente código?
#surveys_df.loc[[0, 10, 333, 45, 21, 598653], :]

**NOTA**: Las etiquetas utilizadas deben estar incluidas en el DataFrame o se obtendrá un error de tipo KeyError.

La indexación por etiquetas (`loc`) difiere de la indexación por números enteros (`iloc`). Cuando usamos loc, los limites inicial y final se incluyen. Cuando usamos loc, podemos usar números enteros, pero dichos números enteros harán referencia a etiquetas usadas a manera de índice y no a la posición. Por ejemplo, si usamos loc y seleccionamos 1:4 vamos a obtener resultados diferentes que si usamos iloc para seleccionar las filas 1:4.

Podemos seleccionar un dato específico utilizando la la intersección de una fila y una columna dentro del DataFrame, junto con la indexación basada en números enteros iloc:

**data.iloc[fila, columna]**

In [199]:
surveys_df.head()

   record_id  month  day  year  plot species sex  wgt
0          1      7   16  1977     2      NL   M  NaN
1          2      7   16  1977     3      NL   M  NaN
2          3      7   16  1977     2      DM   F  NaN
3          4      7   16  1977     7      DM   M  NaN
4          5      7   16  1977     3      DM   M  NaN

In [208]:
surveys_df[['year', 'record_id']]

       year  record_id
0      1977          1
1      1977          2
2      1977          3
3      1977          4
4      1977          5
...     ...        ...
35544  2002      35545
35545  2002      35546
35546  2002      35547
35547  2002      35548
35548  2002      35549

[35549 rows x 2 columns]

In [213]:
surveys_df.iloc[1:3,:][['record_id', 'year']]

   record_id  year
1          2  1977
2          3  1977

In [217]:
surveys_df[surveys_df['plot'] == 7]['year'].mean()

1990.6801470588234

In [220]:
surveys_df[surveys_df['plot'] == 7].mean()['year']

/var/folders/0j/9w1mlgsj5mn089b181zj3y2m0000gn/T/ipykernel_3247/565217979.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  surveys_df[surveys_df['plot'] == 7].mean()['year']

1990.6801470588234

Recuerda que la indexación en Python inicia en 0. Así que, la direccíon basada en índice [2, 6] selecciona el elemento ubicado en la intersección de la tercera fila (índice 2) y la séptima columna (índice 6) en el DataFrame.

In [ ]:
surveys_df[:8]

In [ ]:
surveys_df[1:4]

In [ ]:
surveys_df.iloc[0:4, 0:]

In [ ]:
surveys_df.iloc[0:4, :]

In [ ]:
surveys_df.iloc[0:4]

In [ ]:
surveys_df.iloc[0:4, 1:7]